# ParameterMapIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterMapIterator Class
Members See Also
---
An iterator to a map relating a parameter name (the key, a String) to a parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public abstract class ParameterMapIterator : APIObject,
	IEnumerator
```

Visual Basic
---
```text
Public MustInherit Class ParameterMapIterator _
	Inherits APIObject _
	Implements IEnumerator
```

Visual C++
---
```text
public ref class ParameterMapIterator abstract : public APIObject,
	IEnumerator
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..ParameterMapIterator
# See Also
ParameterMapIterator Members
Autodesk.Revit.DB Namespace